# YOLOv5 Reproduction 🚀 by GuoQuanhao, GPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [32, 3, 2]],  # 1-P2/4
   [-1, 1, C3, [64]],
   [-1, 1, Conv, [64, 3, 2]],  # 3-P3/8
   [-1, 2, C3, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 5-P4/16
   [-1, 2, C3, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 7-P5/32
   [-1, 1, C3, [128]],
 
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [128, False]],  # 12

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [64, False]],  # 16 (P4/16-medium)

   [-1, 1, Conv, [64, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [64, False]],  # 19 (P5/32-large)

   [[12, 16, 19], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
